import datetime
import urllib.request
import json

date = datetime.datetime.now()      # Η μεταβλητή date περιέχει την τρέχουσα ημερομηνία.
currentYear = date.strftime("%Y")   # Η μεταβλητή currentYear περιέχει τον τρέχοντα χρόνο.
currentMonth = date.strftime("%m")  # Η μεταβλητή currentMonth περιέχει τον τρέχοντα μήνα.
currentDay = date.strftime("%d")    # Η μεταβλητή currentDay περιέχει την τρέχουσα μέρα.

Days = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10",    # Η λίστα Days περιέχει όλες τις μέρες του μήνα.
             "11", "12", "13", "14", "15", "16", "17", "18", "19", "20",
             "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31"]

d = currentDay   # Η μεταβλητή d περιέχει την τρέχουσα μέρα.

if (d[0] == "0"):  # Ελέγχω εάν η μεταβλητή d είναι από 01 εώς 09 και αν είναι αφαιρώ το 0.
    d = d.replace("0", "")

changeDay = []     # Η λίστα changeDay θα περιέχει τις μέρες του τρέχοντος μήνα.

for i in Days:     # Με αυτή τη δομή επανάληψης θα βάλω στη λίστα changeDay τις μέρες του τρέχοντος μήνα.
    if(i > d):
        break      # Εάν το i περάσει την τρέχουσα μέρα διακόπτω την δομή επανάληψης,
    else:          # αλλιώς εκχωρώ το i στη λίστα changeDay, όπου το i αντιπροσοπεύει την κάθε μέρα του τρέχοντος μήνα.
        changeDay.append(i)

output = []        # Στην λίστα output θα εκχωρήσω τον αριθμό που εμφανίζεται συχνότερα στο ΚΙΝΟ κάθε μέρα του τρέχοντος μήνα.

d = int(d)         # Μετατρέπω τη μεταβλητή d σε integer, όπου αντιπροσοπεύει το πλήθος των μερών που διανύσαμε μέχρι τώρα.

print("\nΟ αριθμός που εμφανίζεται συχνότερα στο ΚΙΝΟ κάθε μέρα του τρέχοντος μήνα είναι:")

for i in range (d): # Με αυτή τη δομή επανάληψης θα ξεκινώ από την πρώτη μέρα του μήνα και θα φτάνω μέχρι την τρέχουσα μέρα.

    max = 0       # Με τη μεταβλητή max θα συγκρίνω το πλήθος που εμφανίζεται ο κάθε αριθμός για κάθε μέρα ξεχωριστά,
                  # και συνεπώς η μεταβλητή max θα περιέχει το μεγαλύτερο πλήθος εμφ΄άνισης κάποιου αριθμού.

    temp = changeDay[i]  # Στην μεταβλητή temp εκχωρώ την i μέρα του μήνα.
    changeDate = currentYear + "-" + currentMonth + "-" + temp  # "Χτίζω" την τρέχουσα ημερομηνία και την αποθηκεύω στην μεταβλητή changeDate.

    url = "https://api.opap.gr/draws/v3.0/1100/draw-date/" + changeDate + "/" + changeDate + "/draw-id" # Προσθέτω στο url την ημερομηνία.
    r = urllib.request.urlopen(url)
    draw_id = r.read()              # Διαβάζω τα id των κληρώσεων της i μέρας και τα αποθηκεύω στη μεταβλητή draw_id.
    draw_id = draw_id.decode()
    draw_id = list(draw_id)   # Μετατρέπω σε λίστα το περιεχόμενο της μεταβλητής draw_id, για να διώξω τoυς χαρακτήρες "[" και "]",
    draw_id.pop(0)            # από την αρχή και το τέλος της λίστας.
    draw_id.pop()             # π.χ η λίστα μου περιέχει -> [852886,852887,...,853064,853065] , όπου κάθε χαρακτήρας έχει μία διαφορετική θέση στη λίστα.
                              # Με το draw_id.pop(0) -> 852886,852887,...,853064,853065]
                              # και με το draw_id.pop() -> 852886,852887,...,853064,853065

    IDs = []                  # Στη λίστα IDs θα βάλω όλα τα id των κληρώσεων της i μέρας.
    value = ""                # Η μεταβλητή value θα βοηθήσει στο να "χτίσω" το κάθε id μέσα από την λίστα.

    for g in range (len(draw_id)):
        if(draw_id[g] != ","):
                value += draw_id[g]  # Χτίζω το id μέχρι να βρω "," , όπου αυτό θα σημαίνει πως έχω φτάσει στο τέλος του id.
        else:
            IDs.append(value)        # Όταν φτάσω στο "," προσθέτω το value στη λίστα IDs.
            value = ""

    t = []                           # Στη λίστα t θα αποθηκεύω όλους τους αριθμούς που κληρώθηκαν την i μέρα.

    for j in range (len(IDs)):       # Με αυτή τη δομή επανάληψης θα παίρνω όλους τους αριθμούς που κηρώθηκαν την i μέρα, και θα τους αποθηκεύω στη λίστα t.
        id = IDs[j]
        url_2 = "https://api.opap.gr/draws/v3.0/1100/" + id
        r2 = urllib.request.urlopen(url_2)
        page_content = r2.read()
        page_content = page_content.decode()
        dict = json.loads(page_content)         # Μετατρέπω το page_content σε λεξικό.
        t.extend(dict["winningNumbers"]["list"])

    for h in range (len(t)):  # Με αυτή τη δομή επανάληψης θα βρω για τις κληρώσεις της i μέρας τον αριθμό που εμφανίζεται τις περισσότερες φορές.
        c = t[h]              # Στη μεταβλητή c εκχωρώ τον αριθμό που βρίσκεται στην h θέση της λίστας.
        x = t.count(c)        # Στη μεταβλητή x αποθηκεύω το πλήθος επαναλήψεων του αριθμού c.
        if (max < x):
            max = x           # Εάν το x είναι μεγαλύτερο του max, το max παίρνει την τιμή του x,
            pos = h           # και στο pos αποθηκεύω την θέση του αριθμού με τις x εμφανίσεις.

    output.append(t[pos])     # Προσθέτω στο τέλος της λίστας output τον αριθμό που βρήκα.


for k in range (len(output)):
    print("\nΤην", k + 1, "η μέρα είναι ο αριθμός", output[k])
