import math

filename = input("Give file name/path: ")
f = open(filename, "r")
f = f.read()

text = []  # Στη λίστα text θα εκχωρώ τους μονούς αριθμούς.

for i in range (len(f)):
    n = ord(f[i])
    if((n % 2) != 0):
        text.append(n)

list = text.copy() # Αντιγράφω το περιεχόμενο της λίστας text στη λίστα list.
list.sort() # Ταξινομώ τη λίστα list έτσι ώστε να έχω δίπλα δίπλα τους αριθμούς που επαναλαμβάνονται.

rep = [] # Στη λίστα rep θα αποθηκεύω τον αριθμό εμφάνισης του κάθε γράμματος,
l = [] # και στη συνέχεια στη λίστα l θα αποθηκεύω το γράμμα για το οποίο έλεγξα.
k = 0;

while (k < len(list)):
    char = list[k] # Η μεταβλητή char θα περιέχει τον χαρακτήρα που βρίσκεται στη κ θέση της λίστας.
    if((char >= 65 and char <= 90) or (char >= 97 and char <= 122)): # Ελέγχω εάν ο χαρακτήρας είναι γράμμα.
        count = list.count(char) # Στη μεταβλητή count θα αποθηκεύεται ο αριθμός εμφάνισης του κάθε γράμματος.
        rep.append(count) # Εκχωρώ στη λίστα rep την τιμή της μεταβλητής count, που αντιστοιχεί στο char.
        k += count  # Προσθέτω στη μεταβλητή k το count για να προσπεράσω τα επαναλαμβανόμενα γράμματα.
        l.append(char) # Εκχωρώ στη λίστα l το char.
    else:
        k += 1 # Αυξάνω το k κατά 1 εφόσον το char δεν είναι γράμμα.

print("\nΣτατιστικά εμφάνισης του κάθε γράμματος:\n")

for j in range (len(l)):
    calc = (rep[j] / len(list)) * 100 # Αποθηκεύω στην μεταβλητή calc το ποσοστό(%) εμφάνισης του κάθε γράμματος.
    calc = math.ceil(calc) # Στρογγυλοποιώ τη μεταβλητή calc προς τα πάνω.
    out = calc * "*"
    print(chr(l[j]), " => ", out, calc, "%\n")
